Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.IsLoginValid
Checks whether there is a authenticated user.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.Login
Authenticate with Autodesk ID. Popup generic login UI in Navisworks to allow users to enter the credentials.
Returns: true if authenticated or false if failed to authenticate.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.LoginUserName
Gets the current authenticated user's Autodesk ID.
Returns: Autodesk ID. Null if no user is authenticated.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.Logout
Logout the current authenticated user.
Returns: true if succeeded or false if failed.